Tekla Open API Reference for Tekla Structures 2025
NumberingSeriesNullable Class
 The NumberingSeriesNullable class describes how an object is to be numbered.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.NumberingSeriesNullable
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class NumberingSeriesNullable
<SerializableAttribute>
Public NotInheritable Class NumberingSeriesNullable
The NumberingSeriesNullable type exposes the following members.
Constructors
Name | Description
NumberingSeriesNullable()
 Initializes a new instance of the NumberingSeriesNullable class.
NumberingSeriesNullable(String, Int32)
 Initializes a new instance of the NumberingSeriesNullable class with the given arguments.
Top
Properties
Name | Description
Prefix
 Gets or sets the numbering prefix.
StartNumber
 Gets or sets the numbering start number.
Top
See Also
Reference
Tekla.Structures.Model Namespace